<%@ page contentType="text/html; charset=utf-8" %>
<!doctype html>
<html lang="ko">
<head>
<title><%=util.Property.title %></title>
<%@ include file="/WEB-INF/view//include/headHtml.jsp" %>
</head>
<body>
<div id="boardWrap" class="bbs">
	<div class="pageTitle">
		<h2>자기소개</h2>
	</div>
	<!--//pageTitle-->
	<div class="write">
		<table>
			<colgroup>
				<col style="width:150px"/>
				<col style="width:*"/>
			</colgroup>
			<tbody>
				<tr>
					<th>[직무 수행 경험]</th>
					<td>
						빅데이터분석(with파이썬)과 엘라스틱서치를 활용한 자바(Java) 웹 개발자양성수업을 통해서 Java, python, Spring, Spring Boot, JAP, Jquery, 
						CSS, HTML, Rest API, SQL 등 다양한 언어들을 습득하였습니다.<br>
						습득한 언어들을 활용하여 팀 프로젝트와 개인 프로젝트에서 댓글 게시판, 답변 게시판, 갤러리, 지도 API, 결제 API 등 여러 종류의 경험을 했습니다.<br>
						앞에 언급한 게시판들은 Rest API 호출, Ajax를 사용한 비동기 호출 방식, JPA등 여러 가지방식으로 활용하여 작성하였습니다.<br>
						이외에도 이전에 보안교육과 보안회사에 다닌 경험으로 리눅스 및 다양한 운영체제를 다루었으며 해킹 및 보안에 대한 중요성을 누구보다 잘 인지하고 있습니다.<br>
						위와 같은 경험을 바탕으로 사용자들의 데이터 보호와 고객사들의 요청을 발 빠르게 이해하고 수행할 수 있습니다.
					</td>
				</tr>
				<tr>
					<th>[문제 해결 능력]</th>
					<td>
						호텔 예약 시스템 프로젝트를 통해 협업 능력 및 기술 역량을 쌓을 수 있었습니다.<br>
						먼저, 시나리오 설계 단계에서 팀원들과 의견 충돌이 있었습니다. 이런 상황에서 팀원들을 설득하기 위해 모두의 의견을 종합했습니다. 
						그리고 발생하는 문제점들을 팀원들에게 화이트보드에 적어가면서 해결 방안을 제시해 의견 충돌을 해결해 나갔습니다.<br>
						또한 프로젝트에서 예약 및 결제 기능을 담당하여 결제 기능을 구현하던 중 API 관련해서 많은 어려움이 있었습니다. 특히 결제 API 모듈 사용 시 필요한 데이터가 맞지 않아서 결제가 진행되지 않았습니다. 문제를 해결하기 위해서 결제 모듈 회사에서 제공하는 문서와 상담사를 통해 정확한 사용법과 데이터를 습득하였습니다.
						프로젝트를 마무리한 후 API를 다루는 기술을 향상하기 위해서 API를 활용한 게시판을 구현해봤습니다.
						이처럼 직무능력 향상을 위한 가상프로젝트는 많은 도움이 되었습니다.
					</td>
				</tr>
				<tr>
					<th>[장점 및 단점]</th>
					<td>
						저의 장점은 주어진 문제 및 상황에 대해서 책임감을 느끼고 해결하기 위해 포기하지 않는 성격입니다. 한번 시작한 일은 책임을 지며 무슨 수를 쓰더라도 포기하지 않습니다.
						국비 수업 과정 중 계좌관리 프로그램 과제 중 힘들어하는 팀원이 있었습니다.
						해당 팀원을 다독이며 배웠던 정보를 이용하여 과제를 해결할 때까지 포기하지 않고 알려주었습니다. 처음에는 힘들어했지만, 과제를 해결하는 팀원을 보고 뿌듯함을 느꼈습니다.
						제가 생각하는 단점은 주어진 일에 몰두하여 다소 스트레스를 받는다는 것입니다.
						이러한 단점을 극복하기 위해 다른 사람들과 코드 리뷰를 하면서 주변 환경을 환기하고 스트레스를 해소하여 일의 효율성을 향상했습니다.
					</td>
				</tr>
				<tr>
					<th>[입사 후 포부]</th>
					<td>
						빠른 변화와 다양한 고객사들의 요구사항을 정확하게 이해하고 수용해 나가겠습니다.
						익숙한 언어에 안주하지 않고 새롭게 나오는 언어들을 학습하여 빠르게 변하는
						흐름에 뒤처지지 않도록 노력할 것입니다. 또한
						고객사들의 요구사항을 정확하고 빠르게 해결하기 위해서 고정된 사고방식이 아닌 다양
						한 관점으로 문제를 바라보며 해결해 나갈 것입니다.
						마지막으로 개발은 혼자 하는 것이 아닌 다른 팀원들과 협업이 중요하다고 생각합니다.
						여러 팀원과 적극적인 의사소통을 통해 다양한 방법으로 주어진 문제를 해결해 나갈 것입니다.
						적극적인 자세로 팀원들과 잘 스며드는 인재가 되도록 노력하겠습니다.
					</td>
				</tr>
			</tbody>
		</table>
	</div>
</div>
<!--//boardWrap-->
</body>
</html>